# Personal machine extras (SETUP_PROFILE=personal)
cask "antigravity"
cask "cursor"
cask "discord"
cask "docker-desktop"
cask "google-drive"
cask "raindropio"
cask "raspberry-pi-imager"
cask "scratch"
cask "utm"
cask "wps"
mas "HP", id: 1474276998
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "WhatsApp", id: 310633997
