tap "alexstrnik/browserino"
tap "derailed/k9s"
brew "bat"
brew "eza"
brew "fzf"
brew "git"
brew "go"
brew "kubectx"
brew "kubernetes-cli"
brew "lazygit"
brew "libpq"
brew "mas"
brew "minikube"
brew "neovim"
brew "nvm"
brew "pyenv"
brew "qemu"
brew "stow"
brew "tmux"
brew "watch"
brew "wget"
brew "zinit"
brew "zoxide"
brew "zsh"
brew "derailed/k9s/k9s"
cask "appcleaner"
cask "brave-browser"
cask "alexstrnik/browserino/browserino"
cask "cap"
cask "cmux"
cask "finicky"
cask "font-hack-nerd-font"
cask "fork"
cask "google-chrome"
cask "iterm2"
cask "loop"
cask "obsidian"
cask "ollama-app"
cask "visual-studio-code"