tap "alexstrnik/browserino"
tap "derailed/k9s"
brew "bat"
brew "bottom"
brew "btop"
brew "direnv"
brew "eza"
brew "fd"
brew "fzf"
brew "ripgrep"
brew "thefuck"
brew "tldr"
brew "dive"
brew "git"
brew "git-extras"
brew "gh"
brew "tig"
brew "git-absorb"
brew "git-open"
brew "git-delta"
brew "go"
brew "kubectx"
brew "kubernetes-cli"
brew "lazygit"
brew "libpq"
brew "mas"
brew "minikube"
brew "neovim"
brew "nvm"
brew "pyenv"
brew "qemu"
brew "stow"
brew "tmux"
brew "watch"
brew "wget"
brew "zinit"
brew "zoxide"
brew "zsh"
brew "jq"
brew "yq"
brew "httpie"
brew "htop"
brew "lazydocker"
brew "uv"
brew "derailed/k9s/k9s"
cask "appcleaner"
cask "brave-browser"
cask "alexstrnik/browserino/browserino"
cask "cap"
cask "cmux"
cask "finicky"
cask "font-hack-nerd-font"
cask "fork"
cask "google-chrome"
cask "iterm2"
cask "loop"
cask "obsidian"
cask "ollama-app"
cask "visual-studio-code"
vscode "chakrounanas.turbo-console-log"
vscode "apenara.gas-intellisense"
vscode "davidanson.vscode-markdownlint"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "tomoki1207.pdf"