tap "homebrew/bundle"
brew "bat"
brew "eza"
brew "fzf"
brew "git"
brew "go"
brew "kubernetes-cli"
brew "kubectx"
brew "mas"
brew "minikube"
brew "neovim"
brew "nvm"
brew "pyenv"
brew "qemu"
brew "stow"
brew "tmux"
brew "watch"
brew "zoxide"
brew "zplug"
brew "zsh"
cask "appcleaner"
cask "brave-browser"
cask "discord"
cask "docker"
cask "finicky"
cask "font-hack-nerd-font"
cask "fork"
cask "google-drive"
cask "iterm2"
cask "maccy"
cask "raindropio"
cask "raspberry-pi-imager"
cask "scratch"
cask "slack"
cask "utm"
cask "visual-studio-code"
cask "zoom"
# mas "Bitwarden", id: 1352778147
# mas "Goodnotes", id: 1444383602
# mas "HP Smart", id: 1474276998
# mas "Keynote", id: 409183694
# mas "Microsoft Outlook", id: 985367838
# mas "Numbers", id: 409203825
# mas "Pages", id: 409201541
# mas "Playgrounds", id: 1496833156
# mas "Telegram", id: 747648890
# mas "WhatsApp", id: 1147396723
# vscode "bierner.markdown-mermaid"
# vscode "catppuccin.catppuccin-vsc"
# vscode "eamodio.gitlens"
# vscode "eriklynd.json-tools"
# vscode "esbenp.prettier-vscode"
# vscode "formulahendry.auto-close-tag"
# vscode "foxundermoon.shell-format"
# vscode "golang.go"
# vscode "graphql.vscode-graphql"
# vscode "graphql.vscode-graphql-syntax"
# vscode "gruntfuggly.todo-tree"
# vscode "hashicorp.terraform"
# vscode "ms-azuretools.vscode-docker"
# vscode "ms-vscode-remote.remote-containers"
# vscode "ms-vscode.makefile-tools"
# vscode "ms-vsliveshare.vsliveshare"
# vscode "redhat.vscode-redhat-account"
# vscode "redhat.vscode-yaml"
# vscode "streetsidesoftware.code-spell-checker"
# vscode "unifiedjs.vscode-mdx"
# vscode "yzhang.markdown-all-in-one"
